아래 코드를 실행시키고 문제에 답하시오.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# 문제1 - 15점

* 수학, 영어 점수의 평균을 구하고, 점수가 높은 순서대로 정렬한 후 결과값으로 **점수가 높은 5명의 점수를 출력**하세요.

* 리스트 순서대로 학생 한 명의 점수입니다.
* hint: for문 사용

In [2]:
english = [84, 76, 86, 90, 73, 85, 81, 71, 89, 100]
math = [72, 76, 86, 71, 69, 96, 74, 83, 87, 68]

# 문제2 -15점

* 다음은 2022년 7월 26일 오후 2시 기준, 원화 환율입니다.
  (미국:1309.70$, 유럽연합:1339.30€, 중국:193.84¥, 영국:1579.96£)
* 환전하려는 금액을 입력 받고, 나라를 입력 받아서 환율을 **소수점 2자리**로 출력하세요. 
* Hint: 환전 금액과 나라 입력 시 input 함수를, 국가별 환율 계산에는 조건문을 사용하세요.

<답안 예시>

환전 금액(원화):8000

국가 선택(미국/유럽연합/중국/영국):미국

6.11

# 문제3 - 25점

### 문제 [3-1] - 4점

midwest.csv를 불러와 midwest에 저장하고, 위에서부터 10행까지 출력하시오.

### 문제 [3-2] - 8점

* popwhite는 해당 지역의 백인 인구, poptotal은 해당 지역의 전체 인구를 나타냅니다. 

* midwest 데이터에 '전체 인구 대비 백인 인구 백분율' 변수인 percent 열을 추가하세요.

### 문제 [3-3] - 5점

* percent 열의 값을 내림차순으로 정렬하세요.

### 문제 [3-4] - 8점

* county가 'SCOTT'인 경우와 county가 'PIATT'인 경우의 poptotal 열의 평균을 각각 구해서 출력하세요.

* hint: query 함수와 mean 함수 사용

# 문제4 - 45점

다음 데이터를 사용하여 각 문항에 답하세요.

In [3]:
titanic=sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### 문제 [4-1] - 8점

titanic에서 열별 결측치 여부를 확인하고, 결측치가 존재한다면 결측치를 해당 열의 평균값으로 채우세요.

### 문제 [4-2] - 6점

* 수치형 데이터의 열별 분포를 간략히 요약해 나타내세요.

* 평균, 최댓값, 사분위수 등

### 문제 [4-3] - 8점

titanic에서 sex와 pclass 별 생존율을 구하세요.

### 문제 [4-4] - 7점

* pclass 별 사망과 생존 수치를 막대그래프로 나타내세요.

* sex 별 사망과 생존 수치를 막대그래프로 나타내세요.

* hint: countplot 함수 사용

### 문제 [4-5] - 8점

* titanic에서 age가 20살 이상이면 adult로, 20살 미만이면 child로 나타내는 label열을 추가하세요.

* hint: apply, lambda 함수 사용

### 문제 [4-6] - 8점

* titanic에서 pclass, sex, age, sibsp, parch, class 열만 뽑은 후, parch의 값이 0인 행만 titanic1에 저장하세요.

* 이때 새롭게 만들어진 titanic1의 index는 0부터 다시 시작하도록 하세요.

* hint: loc 함수 사용

# END

## 수고하셨습니다:) 좋은 결과 있기를 바라며, 코딩테스트는 절대적 평가 기준이 아닙니다.